{
   "meta": {
      "theme": "elegant"
   },
   "basics": {
      "name": "Tomáš Dostál",
      "label": "Software Engineer",
      "picture": "img.webp",
      "email": "me@tdostal.eu",
      "phone": "+420 605 066 470",
      "website": "https://tdostal.eu",
      "summary": "I'm a creative and curious computer science fan based in the Czech Republic. Looking forward to doing something great and meeting amazing people. I believe that computers should make our lives easier and I'm doing my best for this idea to come true. Automatisation is something I find very fascinating and satisfying. I'm a big fan of smart home technologies, and I enjoy creating and building new things with both new and already-known technologies. In the past few years, I have been delivering backend solutions mostly written in Python in collaborative environments surrounded by awesome people. I believe that every problem gives us a chance to find a better way to do things.",
      "location": {
         "address": "",
         "postalCode": "",
         "city": "Prague",
         "region": "Czech Republic"
      },
      "profiles": [
         {
            "network": "Github",
            "username": "tomas-dostal",
            "url": "https://github.com/tomas-dostal"
         },
         {
            "network": "LinkedIn",
            "username": "tomas-dostal",
            "url": "https://www.linkedin.com/in/tomas-dostal/"
         }
      ]
   },
   "work": [
      {
         "name": "Showmax s.r.o./ Carpiness s.r.o.",
         "position": "Software Engineer",
         "url": "https://www.showmax.com/",
         "startDate": "2022-09-01",
         "endDate": "2024-03-31",
         "summary": "My role as a member of media encoding team in Showmax, one of the largest VOD providers in the African continent, was focused heavily on improving the user experience through enhancing the encoding and delivery process of media files. Apart from that, my role insists on making our internal systems better for everyone to use. Thanks to the size of the company I could get in touch with a wide range of technologies and there was always something I could choose from. I was heavily oriented in working with RESTful APIs and technologies like Python, Docker, git, pytest, but also SQL and EKL. Thanks to one of our company values - responsibility - we used the DevOps approach so we would be able to fully own and stand behind our changes and features. Last but not least, my team held on-call and as a team, we were addressing all the issues our customers encountered especially during the evening peak hours.",
         "highlights": [
            "Eliminated the need for manual pairing of subtitles by developing automated pairing tool.",
            "Optimised data processing in Airflow thanks to more efficient implementation.",
            "Improved the alert notification system for live content, reducing false positive alerts.",
            "One player rules them all - Unified video players in our internal content management system for better user experience and easier maintenance.",
            "Refactored code for better readability.",
            "For better user-experience, actively tested our applications and raised tickets for issues encountered.",
            "Actively worked to increase usability of internal systems."
         ]
      },
      {
         "name": "Paysure Technology s.r.o / Paysure Solutions Ltd",
         "position": "Software Developer",
         "url": "https://paysure.solutions/",
         "startDate": "2021-09-01",
         "endDate": "2022-04-11",
         "summary": "Contributed as a backend developer at Paysure, a dynamic fintech startup revolutionizing B2B payments with innovative criteria-based payment limits. Strengthened my Python skills here, and wrote tests on a daily basis. My work in Paysure was mostly about extending the existing codebase and writing tests to ensure product stability and extendibility.  Utilized technologies like Python, Django, Flask, Docker, and Git as well as collaborative tools like ClickUp, Confluence, Bitbucket, and Slack. ",
         "highlights": [
            "Improved logging capabilities allowing us easier bug fixing and better analysis.",
            "Introduced satic type checking tool, to the codebase, increasing code reliability and maintainability.",
            "On BE side implemented key features such as translations and universal links, and conducted rigorous testing to ensure high quality,which ended up by passing of strict Apple quality checks. ",
            "Developed a solution for OTP, enhancing the security and usability of the system.",
            "Developed and executed comprehensive test suites to ensure proper integration with client's APIs",
            "Lost the fear of asking questions. "
         ]
      },
      {
         "name": "Freelancer",
         "position": "Web developer",
         "url": "https://portfolio.dostál.eu/",
         "startDate": "2018-01-01",
         "summary": "As a website developer, I work closely with clients to create custom sites that meet their specific needs, from initial analysis to deployment and ongoing maintenance. I specialize in working with clients who have meaningful ideas, ensuring that the end result is not only visually pleasing but also beneficial to users. I offer support to my clients, taking care of all aspects including domains, hosting, updates, maintenance, and modifications. This ensures that clients can focus on their own business activities without any worry about their website.",
         "highlights": [
            "Long-term client satisfaction and successful collaborations.",
            "End-to-end website solutions, from domain and hosting setup to ongoing maintenance and support, so clients can focus on their business.",
            "Broad experience in building WordPress CMS sites",
            "SEO and analytics",
            "Hosting services"
         ]
      },
      {
         "name": "DCC Ctyrlistek Opava",
         "position": "Software developer",
         "url": "https://www.dcctyrlistek.cz",
         "startDate": "2018-01-01",
         "endDate": "2018-03-01",
         "summary": "I assisted here with the transition to a new accounting system by developing an automated conversion tool. This simplified the migration of data from the old to the new system, saving a lot time and resources."
      },
      {
         "name": "Project DZO",
         "position": "Identification and improvement of QR code detection",
         "url": "https://www.pdzo.cz/",
         "startDate": "2019-01-01",
         "endDate": "2021-01-01",
         "summary": "[Project DZO](https://www.pdzo.cz/) was a university project aiming to examine the proposed methodology for decontamination of a large number of injured in pre-hospital care and to identify possible shortcomings. My job was to examine possibilities of identification of rescuers with 1-D or 2-D codes for further processing of the captured records."
      },
      {
         "name": "Project MedicalApp",
         "startDate": "2016-01-01",
         "endDate": "2017-01-01",
         "summary": "Since I started exploring the field of IT, I made a lot of my projects. Probably the most significant/interesting one was the medical data viewer „MedicalApp“, which aim was to simplify the process of getting and displaying data from medical facilities. ",
         "highlights": [
            "4th place in category IT in the national round of Secondary Scholar Activity",
            "Combining a wide range of languages (C#, Python, C++) and modern technologies (Unity3D, VTK, Google Drive, GTK3)"
         ]
      }
   ],
   "volunteer": [
      {
         "organization": "Potrebujurousku.cz",
         "position": "Engineering Project Manager & Software developer",
         "website": "https://www.potrebujurousku.cz/",
         "startDate": "2020-08-09",
         "endDate": "2020-12-11",
         "summary": "Co-founder of a COVID-19 regulations monitoring site [potrebujurousku.cz](https://www.potrebujurousku.cz/) ([github](https://github.com/tomas-dostal/potrebujurousku)) (ancestor of the official solution [covid.gov.cz](https://covid.gov.cz)) in the Czech Republic. Back in the COVID days. ",
         "highlights": [
            "Articles about the project in weekly papers '[Respekt](https://www.respekt.cz/agenda/nekdo-to-delat-musi-rika-spoluzakladatelka-webu-potrebuju-rousku-cz)' and '[DenikN](https://denikn.cz/495661/studenti-spustili-web-s-opatrenimi-proti-viru-driv-nez-vlada-pro-lidi-bylo-ubijejici-to-sledovat-vysvetluji)'",
            "Replaced by an official government solution in about three months since published, so the idea of a COVID-19 regulations site was not that bad",
            "Written in Django framework, Python",
            "Scrapping content from the Ministry of Health using BS4 with an attempt to automatically process as much data as possible"
         ]
      },
      {
         "organization": "Domov sv. Josefa",
         "position": "Web developer",
         "website": "https://www.domovsvatehojosefa.cz/",
         "startDate": "2020-01-01",
         "endDate": "2021-12-11",
         "summary": "Redesign of the website [domovenka.cz](domovenka.cz) and general support in the field of web analytics",
         "highlights": [
            "Since I started supporting [domovenka.cz](domovenka.cz), the site raised more than 1.7 million CZK from donations",
            "Enjoyed the cooperation with this non-profit, as their main aim is to help people achieve their goals"
         ]
      }
   ],
   "education": [
      {
         "institution": "FIT CTU, Prague",
         "area": "Informatics",
         "studyType": "Bachelor",
         "startDate": "2019-06-26",
         "endDate": "2023-09-01",
         "courses": [
            "Computer networks",
            "Computer security",
            "Databases",
            "Big data",
            "GIT",
            "Operating systems",
            "Programming in Python",
            "Programming in Java",
            "Programming in C++",
            "Arduino",
            "Digital photography"
         ]
      }
   ],
   "certificates": [
      {
         "name": "The Compostela Pilgrims Certificate",
         "date": "2023-10-29",
         "issuer": "Cathedral of Santiago de Compostela",
         "url": "https://catedraldesantiago.es/"
      },
      {
         "name": "Unified Certified course",
         "date": "2023-07-01",
         "issuer": "Unified Streaming",
         "url": "https://www.unified-streaming.com/academy"
      },
      {
         "name": "Database Design and Programming with SQL",
         "date": "2021-03-01",
         "issuer": "Oracle",
         "url": "https://academy.oracle.com/en/oa-web-overview.html"
      }
   ],
   "awards": [
      {
         "title": "Culture Ambassador - customer comes first",
         "date": "2023-02-20",
         "awarder": "Adrian Huna, Showmax",
         "summary": "For improving platform usability and enhancing overall navigation."
      }
   ],
   "skills": [
      {
         "category": "Development",
         "keywords": [
            "Python",
            "C++",
            "Java (basics)",
            "Django",
            "FastAPI"
         ]
      },
      {
         "category": "Deployment",
         "keywords": [
            "Docker",
            "CI/CD pipelines",
            "Kubernetes (basics)",
            "AWS (basics)"
         ]
      },
      {
         "category": "Data-oriented",
         "keywords": [
            "Oracle SQL",
            "Postgres",
            "ELK Stack"
         ]
      },
      {
         "category": "Other",
         "keywords": [
            "Familiar with Linux Ecosystem",
            "Unified Streaming Platform",
            "Postman"
         ]
      }
   ],
   "languages": [
      {
         "language": "English",
         "fluency": "B2"
      }
   ],
   "references": [
   ]
}
